renesas/ra-fsp-examples/example_projects/ek_ra8m2/_quickstart/quickstart_ek_ra8m2_ep/e2studio/src/menu_ext.c
/*
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/**********************************************************************************************************************
 * File Name    : menu_ext.c
 * Version      : 1.0
 * Description  : Memory demo. Manages demo interface to console and lcd.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.01.2025 1.00     First Release
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdarg.h>

#include "hal_data.h"
#include "r_typedefs.h"

#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "semphr.h"
#include "queue.h"
#include "task.h"
#include "bsp_api.h"

#include "common_init.h"
#include "common_data.h"
#include "common_utils.h"
#include "board_cfg.h"
#include "board_hw_cfg.h"
#include "menu_ext.h"
#include "ospi_b_commands.h"
#include "ospi_b_ep.h"
#include "board_cfg_switch.h"


/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
/* The RA8P1 OSPI flash is Macronix MX25LW51245G */
/* The device is 512M bit (64M Byte) */

#define GPT_CLOCK_MHZ                           (250)

#define OSPI_WEN_BIT_MASK                       (0x02U)
#define OSPI_WIP_BIT_MASK                       (0x01U)
#define OSPI_TEST_PAGE_SIZE                     (512U)
#define OSPI_ERASE_BLOCK_SIZE                   (4096U)

#define WAITING_MESSAGE                         ("Waiting Results")

#define OSPI_START_ADDRESS                      (0x93f00000)        /* CS1 */

#define STATUS_WRITE_ENABLED                    (2)

#define CONNECTION_ABORT_CRTL                   (0x00)
#define MENU_EXIT_CRTL                          (0x20)
#define MENU_ENTER_RESPONSE_CRTL                (0x09)
#define CARRAGE_RETURN                          (0x0D)
#define INPUT_BUFFER                            (0x05)

#define BLOCK_LIMIT                             (64)
#define FOURKB_LIMIT                            (BLOCK_LIMIT / 4)

#undef MODULE_NAME
#define MODULE_NAME     "\r\n%d. OCTO-SPI SPEED DEMONSTRATION\r\n"

#define SUB_OPTIONS     "\r\nCompares the write and read times to and from external Octo-SPI" \
                        "\r\nflash memory\r\n" \
                        "\r\n> Enter the text block size (in multiples of 2 KB, max 64 KB)\r\n" \
                        "and press tab to continue, or space bar to abort : "

#define OSPI_TEST_DATA_LENGTH                   (0x40U)
#define OSPI_SECTOR_SIZE                        (4096U)
#define OSPI_BLOCK_SIZE                         (262144U)

/* Limit test to 4K */
#define WRITE_BLOCK_SIZE                        (64)
#define TEST_BLOCKS                             (64)

#define MAX_BLOCK_SIZE                          (64 * 1024)

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/
/* Block in RAM for performance measurement */
static uint8_t s_read_block[MAX_BLOCK_SIZE];

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
static char_t s_print_buffer[BUFFER_LINE_LENGTH] = {};

static void wait_for_write (void);

static void clear_console (void);
static void set_clock_speed_66mhz(void);
static void set_clock_speed_133mhz (void);
static void ospi_b_change_omclk (bsp_clocks_octaclk_div_t divider);
static void ospi_read_write_print (uint32_t block_size_actual);

static uint32_t validate_user_input (char_t * p_input);
static uint32_t value_validation (uint32_t value);

static fsp_err_t write_test_opi (uint32_t num_blocks);
static fsp_err_t read_test_opi (uint32_t block_size);

static bool_t check_input_value (uint32_t value);

/* Cast OSPI_START_ADDRESS to point to uint8_t  */
static uint8_t * const sp_gp_ospi_cs1 = (uint8_t *) OSPI_START_ADDRESS;

#ifndef USE_TINY_TEST
static uint8_t s_g_test_data[OSPI_TEST_DATA_LENGTH] = "";
#else
static uint8_t  s_g_test_data[OSPI_TEST_DATA_LENGTH] =
{
    // Auto-calibration pattern.
    0x00, 0x00, 0xFF, 0xFF, 0xFF, 0x00, 0x08, 0x00, 0x00, 0xF7, 0xFF, 0x00, 0x08, 0xF7, 0x00, 0xF7,
    0x35, 0x35, 0x35, 0x35, 0xBD, 0xFF, 0xEE, 0xF1, 0x36, 0x36, 0x36, 0x36, 0xBC, 0xFF, 0xEF, 0xF2,
    0x37, 0x37, 0x37, 0x37, 0xBF, 0x01, 0xEE, 0xF1, 0x38, 0x38, 0x38, 0x38, 0xBA, 0x1F, 0x6F, 0xF3,
    0xA5, 0xA5, 0xA5, 0xA5, 0x5A, 0x5A, 0x5A, 0x5A, 0x5A, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFF, 0xFF,
};
#endif

static uint32_t s_test_remain           = WRITE_BLOCK_SIZE;
static uint32_t s_test_current_block    = 0;
static uint32_t s_test_current_sub      = 0;
static size_t   s_data_size             = TEST_BLOCKS * WRITE_BLOCK_SIZE;

static char_t   s_block_sz_str[INPUT_BUFFER] = {};

static uint32_t s_g_counter = 0;

/**********************************************************************************************************************
 * Function Name: ospi_performance_test
 * Description  : erase an area of flash, then write to it followed by a read to verify written data
 * Arguments    : data_size
 *              : ospi_performance_write_result
 *              : ospi_performance_read_result
 * Return Value : None
 *********************************************************************************************************************/
void ospi_performance_test(uint32_t data_size, uint32_t *ospi_performance_write_result,
        uint32_t *ospi_performance_read_result)
{
    fsp_err_t err        = FSP_SUCCESS;

    uint32_t  erase_size = 4096;

    /* OSPI device already opened as it is used for the PLCD graphics */
    err = ospi_b_init();

