renesas/ra-fsp-examples/example_projects/ek_ra8m2/_quickstart/quickstart_ek_ra8m2_ep/e2studio/src/menu_ext.c
    /* Clean the OSPI device up before testing */
    err = ospi_b_set_protocol_to_spi ();

    if (FSP_SUCCESS == err)
    {
        for (uint32_t nb = 0; nb < FOURKB_LIMIT; nb++)
        {
            /* Erase a block of OSPI memory at an offset from the CS1 base address.
             * The cast to (uint8_t *) is required because pointer arithmetic is used
             * to compute the target address, and the erase API expects a uint8_t* type.
             */
            err = g_ospi0.p_api->erase (g_ospi0.p_ctrl, (uint8_t *) (sp_gp_ospi_cs1 + (erase_size * nb)), erase_size);
            assert(FSP_SUCCESS == err);
            wait_for_write ();
        }
    }
    else
    {
        print_to_console("Failed to set device to SPI mode\r\n");
    }

    err = ospi_b_set_protocol_to_opi();
    set_clock_speed_133mhz();

    if (FSP_SUCCESS == err)
    {
        print_to_console("\r\nWriting the text block to external Octo-SPI flash memory ...\r\n");

        err = write_test_opi(data_size / 64);

        *ospi_performance_write_result = s_g_counter;

        print_to_console("Writing to flash completed\r\n");

        if (FSP_SUCCESS != err)
        {
            print_to_console("Flash write failed\r\n");
        }
    }
    else
    {
        print_to_console("Failed to set device to OPI mode\r\n");
    }

    if (FSP_SUCCESS == err)
    {
        print_to_console ("\r\nReading the text block from external Octo-SPI flash memory ...\r\n");

        err = read_test_opi (data_size / 64);

        *ospi_performance_read_result = s_g_counter;

        print_to_console("Reading from flash completed\r\n");

        if (FSP_SUCCESS != err)
        {
            print_to_console("Flash read / verify failed\r\n");
        }
    }

    err = ospi_b_set_protocol_to_spi ();
    set_clock_speed_66mhz();
}
/**********************************************************************************************************************
 End of function ospi_performance_test
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: ext_display_menu
 * Description  : Implements the external flash memory menu
 * Return Value : 0
 *********************************************************************************************************************/
test_fn ext_display_menu(void)
{
    bool_t   valid_block_size  = false;
    int32_t  c                 = -1;
    uint32_t block_size_actual = 0;
    int32_t  block_sz_ndx      = 0;
    int32_t  block_sz_limit    = (INPUT_BUFFER-2); /* Allowing for TAB and End of Message */
    uint32_t value             = 0;
    char_t   res_str[24];
    clear_console();
    sprintf(res_str, WAITING_MESSAGE);
    sprintf (s_print_buffer, MODULE_NAME, g_selected_menu);
    print_to_console(s_print_buffer);
    print_to_console(SUB_OPTIONS);

    /* Keep trying to read a valid text block size complete the loop in one of two ways:
     * [1] Valid block size is entered (2K boundary range 2-64K) followed by TAB
     * [2] Space Bar is pressed at any stage
     */
    while (false == valid_block_size)
    {
        /* Reset input state */
        c            = -1;
        block_sz_ndx = 0;
        memset (&s_block_sz_str, 0, INPUT_BUFFER);
        while ((CONNECTION_ABORT_CRTL != c))
        {
            c = input_from_console();
            if ((block_sz_ndx < block_sz_limit) && (BACK_SPACE != c) && (BACK_SPACE_PUTTY != c) && (CARRAGE_RETURN != c)
                    && (MENU_ENTER_RESPONSE_CRTL != c))
            {
                /* Cast to req type */
                s_block_sz_str[block_sz_ndx] = (char_t)c;
                block_sz_ndx++;
            }
            else if (((BACK_SPACE == c) || (BACK_SPACE_PUTTY == c)) && (block_sz_ndx > 0))
            {
                s_block_sz_str[block_sz_ndx - 1] = '\0';
                block_sz_ndx--;
                print_to_console("\b \b");
            }
            else if ((0 == block_sz_ndx) || (CARRAGE_RETURN == c))
            {
                __NOP();
            }
            else
            {
                /* maximum block size exceeded (4 digits / characters entered) */
                s_block_sz_str[block_sz_ndx] = MENU_ENTER_RESPONSE_CRTL;
                c                            = MENU_ENTER_RESPONSE_CRTL;
                break;
            }
            if (MENU_EXIT_CRTL == c)
            {
                /* Abort the test */
                valid_block_size  = true;
                block_size_actual = 0;
                break;
            }
            if ((MENU_ENTER_RESPONSE_CRTL == c) || (CARRAGE_RETURN == c))
            {
                break;
            }
            if ((CARRAGE_RETURN != c) && (BACK_SPACE != c))
            {

                /* Cast 'c' to char_t to ensure it matches the expected type for formatted output.
                 * This is important if 'c' is defined as a wider or different integer type,
                 * ensuring correct character representation in sprintf.*/
                sprintf (s_print_buffer, "%c", (char_t)c);
                print_to_console(s_print_buffer);
            }
        }


        /* If the input was terminated with a TAB then attempt to process it */
        if ((MENU_ENTER_RESPONSE_CRTL == c) || (CARRAGE_RETURN == c))
        {
            value = validate_user_input (&s_block_sz_str[0]);
        }
        vTaskDelay (10);

        /* Exit the while loop when received space bar pressed */
        if (MENU_EXIT_CRTL == c)
        {
            break;
        }

        value            = value_validation(value);
        valid_block_size = check_input_value (value);
    }
    block_size_actual = value;
    if ((MENU_ENTER_RESPONSE_CRTL == c) && (0 != block_size_actual))
    {
        ospi_read_write_print(value);
    }
    while ((CONNECTION_ABORT_CRTL != c))
    {
        if ((MENU_EXIT_CRTL == c) || (0x00 == c))
        {
            break;
        }

        c = input_from_console ();
    }
    return (0);
}
/**********************************************************************************************************************
 End of function ext_display_menu
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: clear_console
 * Description  : Send escape codes to clear the console and home the cursor
 * Return Value : None
 *********************************************************************************************************************/
static void clear_console(void)
{
    print_to_console("\x1b[2J\x1b[H");
}
/**********************************************************************************************************************
 End of function clear_console
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: wait_for_write
 * Description  : Read the status register until it indicates that the write has completed
 * Return Value : None
 *********************************************************************************************************************/
static void wait_for_write(void)
{
    spi_flash_status_t status =
    { 0 };

    do
    {
        assert(FSP_SUCCESS == g_ospi0.p_api -> statusGet (g_ospi0.p_ctrl, &status));
    }
    while (status.write_in_progress);
}
/**********************************************************************************************************************
 End of function wait_for_write
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_test_opi
 * Description  : write data to the OSPI flash and use a timer to time the write duration
 * Argument     : num_blocks
 * Return Value : FSP_SUCCESS on success or an error code on failure
 *********************************************************************************************************************/
static fsp_err_t write_test_opi(uint32_t num_blocks)
{
    fsp_err_t err;

    fsp_err_t retval = FSP_SUCCESS;

    timer_status_t timer_status;

    srand(0);

    /* Cast the result of rand() to uint8_t to ensure only the lower 8 bits are stored.
     * This is important because rand() returns an int, but we only need a byte-sized value.
     * The cast prevents unintended truncation and ensures compatibility with 8-bit operations.
     */
    volatile uint8_t data = (uint8_t) rand();

    R_GPT_Open(g_memory_performance.p_ctrl, g_memory_performance.p_cfg);

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    /* Write the test data in OPI mode */
    s_g_counter = 0;

    for (s_test_current_block = 0; s_test_current_block < num_blocks; s_test_current_block++)
    {
        s_test_remain      = WRITE_BLOCK_SIZE;
        s_test_current_sub = 0;

        while (s_test_remain > 0)
        {
            s_test_remain--;

            /* cast uint8_t from rand function */
            data                                = (uint8_t)rand();
            s_g_test_data[s_test_current_sub++] = data;
        }

        /* Only Time the write function that includes the wait_for_write */
        R_GPT_Start(g_memory_performance.p_ctrl);


        /* Cast the target address to uint8_t* to match the expected type for the OSPI write API.
         * This ensures byte-level access to the calculated memory location, which is derived
         * from the CS1 base address plus an offset based on the current block index.
         */
        err = g_ospi0.p_api->write (g_ospi0.p_ctrl, (s_g_test_data),
                                    (uint8_t *)(sp_gp_ospi_cs1 + (s_test_current_block * WRITE_BLOCK_SIZE)),
                                    WRITE_BLOCK_SIZE);

        wait_for_write();

        R_GPT_Stop(g_memory_performance.p_ctrl);
        R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);

