renesas/ra-fsp-examples/example_projects/ek_ra8m2/_quickstart/quickstart_ek_ra8m2_ep/e2studio/src/menu_ext.c
        if (FSP_SUCCESS != err)
        {
            retval = err;
        }

        /* Dummy delay */
        R_BSP_SoftwareDelay(20, BSP_DELAY_UNITS_MICROSECONDS);
    }
    FSP_CRITICAL_SECTION_EXIT;

    R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);
    s_g_counter = timer_status.counter;

    R_GPT_Close(g_memory_performance.p_ctrl);

    if (FSP_SUCCESS != retval)
    {
        print_to_console("Write failed");
    }

    return (retval);
}
/**********************************************************************************************************************
 End of function write_test_opi
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: read_test_opi
 * Description  : read data from the OSPI flash and use a timer to time the read duration
 * Argument     : block_size - the size of the block to read
 * Return Value : FSP_SUCCESS on success or an error code on failure
 *********************************************************************************************************************/
static fsp_err_t read_test_opi(uint32_t block_size)
{
    fsp_err_t      err = FSP_SUCCESS;

    timer_status_t timer_status;

    uint32_t failing_index = 0;

    uint8_t * p_ptr;

    srand(0);
    volatile uint8_t  data   = (uint8_t) rand(); /* cast uint8_t from rand function */
    volatile uint32_t errors = 0;

    /* Upscale block_size to bytes by multiply by 64 */
    block_size *= 64;

    s_data_size = TEST_BLOCKS * WRITE_BLOCK_SIZE;

    err = R_GPT_Open(g_memory_performance.p_ctrl, g_memory_performance.p_cfg);

    memset(s_read_block, 0, block_size);

    FSP_CRITICAL_SECTION_DEFINE;
    FSP_CRITICAL_SECTION_ENTER;

    R_GPT_Reset(g_memory_performance.p_ctrl);

    /* Read the data and time the read operation */
    p_ptr = sp_gp_ospi_cs1;

    err = R_GPT_Start(g_memory_performance.p_ctrl);

    memcpy(s_read_block, p_ptr, block_size);

    R_GPT_StatusGet(g_memory_performance.p_ctrl, &timer_status);

    s_g_counter = timer_status.counter;
    FSP_CRITICAL_SECTION_EXIT;

    R_GPT_Close(g_memory_performance.p_ctrl);

    p_ptr = s_read_block;

    /* Verify data */
    for (uint32_t i = 0; i < block_size; i++)
    {
        data = (uint8_t) rand(); /* cast uint8_t from rand function */

        if ((*p_ptr) != data)
        {
            if (0 == errors)
            {
                failing_index = i;
            }

            err = FSP_ERR_INVALID_DATA;
            errors++;
        }

        p_ptr++;
    }

    if (errors > 0)
    {
        sprintf(s_print_buffer, "Failed to verify %lu bytes. First verification failure index %lu\r\n"\
                , errors, failing_index);
        print_to_console(s_print_buffer);
    }

    return (err);
}
/**********************************************************************************************************************
 End of function read_test_opi
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: validate_user_input
 * Description  : parse the user input and convert to integer value
 * Argument     : p_input
 * Return Value : Integer value entered, or 0 if the menu exit character was entered
 *********************************************************************************************************************/
static uint32_t validate_user_input(char_t *p_input)
{
    uint32_t result = INVALID_CHARACTER;
    uint32_t value  = 0;
    uint32_t t      = 0;
    uint32_t c      = 0;

    while (true)
    {
        /* Cast to req type */
        c = (uint32_t) (*p_input);

        p_input++;

        if ((c >= '0') && (c <= '9'))
        {
            /* Cast as compiler will interpret result as int */
            value = (uint32_t) (value * 10);

            /* Cast to req type */
            t = (uint32_t) (c - '0');

            /* Cast as compiler will interpret result as int */
            value = (uint32_t) (value + t);
        }
        else
        {
            if (MENU_ENTER_RESPONSE_CRTL == c)
            {
                result = value;
            }

            if (MENU_EXIT_CRTL == c)
            {
                result = 0;
            }

            break;
        }
    }

    return (result);
}
/**********************************************************************************************************************
 End of function validate_user_input
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: ospi_b_change_omclk
* Description  : Changes the OCTACLK divider; assumes PLL2 is being used as the source for OCTACLK
*              : divider New clock divider to switch to
* Return Value : None
*********************************************************************************************************************/
static void ospi_b_change_omclk(bsp_clocks_octaclk_div_t divider)
{
    /* ensure clock source (PLL2 in this example) is running before changing the OCTACLK frequency */
    /* PLL2R should be set up to give a clock speed of 266 MHz */
    bsp_octaclk_settings_t octaclk_settings;
    octaclk_settings.source_clock = BSP_CLOCKS_SOURCE_CLOCK_PLL2R;
    octaclk_settings.divider      = divider;
    R_BSP_OctaclkUpdate(&octaclk_settings);
}
/**********************************************************************************************************************
End of function ospi_b_change_omclk
*********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: set_clock_speed_66mhz
* Description  : set the OSPI flash bit clock to 133 MHz (266 MHz OCTACLK)
* Return Value : None
*********************************************************************************************************************/
static void set_clock_speed_66mhz(void)
{
    /* change the OCTACLK to 133 MHz (to give a device clock of 66 MHz) */
    /* OCTACLK source is configured with 266 MHz input */
    ospi_b_change_omclk(BSP_CLOCKS_OCTACLK_DIV_2);
}
/**********************************************************************************************************************
End of function set_clock_speed_66mhz
*********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: set_clock_speed_133mhz
* Description  : set the OSPI flash bit clock to 133 MHz (266 MHz OCTACLK)
* Return Value : None
*********************************************************************************************************************/
static void set_clock_speed_133mhz(void)
{
    /* change the OCTACLK to 266 MHz (to give a device clock of 133 MHz) */
    /* OCTACLK source is configured with 266 MHz input */
    ospi_b_change_omclk(BSP_CLOCKS_OCTACLK_DIV_1);
}
/**********************************************************************************************************************
End of function set_clock_speed_133mhz
*********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: ospi_read_write_print
 * Description  : .
 * Argument     : block_size_actual
 * Return Value : .
 *********************************************************************************************************************/
static void ospi_read_write_print(uint32_t block_size_actual)
{
    fsp_err_t fsp_err = FSP_SUCCESS;

    uint32_t ospi_performance_write_result = 0;
    uint32_t ospi_performance_read_result  = 0;
    uint32_t ospi_read_result              = 0;
    uint32_t ospi_write_result             = 0;

    char_t   res_str[24];

    sprintf (s_print_buffer, "\r\n\r\nGenerated a text block of %2lu KB in SRAM\r\n", block_size_actual);
    print_to_console(s_print_buffer);

    block_size_actual = block_size_actual * 1024;

    ospi_performance_test (block_size_actual, &ospi_performance_write_result, &ospi_performance_read_result);

    ospi_write_result =  ospi_performance_write_result / GPT_CLOCK_MHZ;
    ospi_read_result  =  ospi_performance_read_result / GPT_CLOCK_MHZ;

    /* Handle error */
    if (FSP_SUCCESS != fsp_err)
    {
        /* Fatal error */
        SYSTEM_ERROR_CFG_
    }

    print_to_console("\r\n-------------------------------------------------");
    print_to_console("\r\nOperation/Flash          Octo-SPI");
    print_to_console("\r\n-------------------------------------------------");

