renesas/ra-fsp-examples/example_projects/ek_ra8m2/_quickstart/quickstart_ek_ra8m2_ep/e2studio/src/menu_ext.c
    sprintf (s_print_buffer, "\r\nWrite                    %6ld", ospi_write_result);
    print_to_console(s_print_buffer);

    sprintf (s_print_buffer, "\r\nRead                     %6ld", ospi_read_result);
    print_to_console(s_print_buffer);

    print_to_console("\r\n-------------------------------------------------");
    print_to_console("\r\nNote: Times are in microseconds");
    print_to_console(MENU_RETURN_INFO);

    sprintf (res_str, "%6ld uS", ospi_write_result);
    sprintf (res_str, "%6ld uS", ospi_read_result);
    sprintf (res_str, "Block Size %6ld Bytes", block_size_actual);

}
/**********************************************************************************************************************
 End of function ospi_read_write_print
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: value_validation
 * Description  : Ensure a provided value is divisible by the defined BLOCK_LIMIT.
 * Argument     : value
 * Return Value : the valid value
 *********************************************************************************************************************/
static uint32_t value_validation(uint32_t value)
{
    if (value < 2)
    {
        value = INVALID_BLOCK_SIZE;
    }
    if ((value > BLOCK_LIMIT) && (value < INVALID_MARKERS))
    {
        value = INVALID_BLOCK_SIZE;
    }
    if ((value > 0) && ((value % 2) != 0)  && (value < INVALID_MARKERS))
    {
        value = INVALID_BLOCK_BOUNDARY;
    }
    return value;
}
/**********************************************************************************************************************
 End of function value_validation
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: check_input_value
 * Description  : Check the value obtained is a valid block size.
 * Arguments    : value: valid_block_size
 * Return Value : true or false if the block size is valid or not
 *********************************************************************************************************************/
static bool_t check_input_value(uint32_t value)
{
    switch (value)
    {

        case INVALID_CHARACTER:
        {
            sprintf(s_print_buffer,
                    "\r\n> Invalid character in entry, enter the text block size specifying a 2K boundary (eg 24)"\
                    " and press tab : ");

            /* ignoring -Wpointer-sign is OK when treating signed char_t array as as unsigned */
            print_to_console(s_print_buffer);
            break;
        }

        case INVALID_BLOCK_SIZE:
        {
            sprintf(s_print_buffer, "\r\n> Invalid size, enter the text block size (eg 24) and press tab " \
                    ": ");

            /* ignoring -Wpointer-sign is OK when treating signed char_t array as as unsigned */
            print_to_console(s_print_buffer);
            break;
        }

        case INVALID_BLOCK_BOUNDARY:
        {
            sprintf(s_print_buffer,
                    "\r\n> Invalid boundary, enter the text block size specifying a 2K boundary (eg 24)"\
                    " and press tab : ");

            /* ignoring -Wpointer-sign is OK when treating signed char_t array as as unsigned */
            print_to_console(s_print_buffer);
            break;
        }

        default:
        {
            return (true);
        }
    }
    return (false);
}
/**********************************************************************************************************************
 End of function check_input_value
 *********************************************************************************************************************/


